In [1]:
# import pandas package
import pandas as pd

# B2.1

In [2]:
# contents of comma_input.txt
!cat comma_input.txt

subhendu, 21, M
Emma, 29, F
James, 35, M

In [3]:
# Reading comma seperated input file to dataframe
# it uses first row of the text file as the default header
pd.read_table("comma_input.txt",delimiter=",")

  subhendu   21   M
0     Emma   29   F
1    James   35   M

In [4]:
# Reading comma seperated input file to dataframe with default header
pd.read_table("comma_input.txt",delimiter=",", header=None)

          0   1   2
0  subhendu  21   M
1      Emma  29   F
2     James  35   M

In [5]:
# Reading comma seperated input file to dataframe with custom header names
pd.read_table("comma_input.txt", delimiter=",", names=["name","age","gender"])

       name  age gender
0  subhendu   21      M
1      Emma   29      F
2     James   35      M

In [6]:
# contents of space_input.txt
!cat space_input.txt

Subhendu maji Finance 45000
Henry smith IT 21000
Erica jones Marketing 12750
Andrew Madrid IT 30500

In [7]:
# Reading space seperated input file to dataframe
# it uses first row of the text file as the default header
pd.read_table("space_input.txt",delimiter=" ")

  Subhendu    maji    Finance  45000
0    Henry   smith         IT  21000
1    Erica   jones  Marketing  12750
2   Andrew  Madrid         IT  30500

In [8]:
# Reading space seperated input file to dataframe with default header
pd.read_table("space_input.txt", delimiter=" ",header=None)

          0       1          2      3
0  Subhendu    maji    Finance  45000
1     Henry   smith         IT  21000
2     Erica   jones  Marketing  12750
3    Andrew  Madrid         IT  30500

In [9]:
# Reading space seperated input file to dataframe with custom header names
pd.read_table("space_input.txt", delimiter=" ", names=["first_name","last_name","department","salary"])

  first_name last_name department  salary
0   Subhendu      maji    Finance   45000
1      Henry     smith         IT   21000
2      Erica     jones  Marketing   12750
3     Andrew    Madrid         IT   30500

# B2.2

In [10]:
# importing sqlite3
import sqlite3

In [11]:
# create table student2121 in database
query = """
        CREATE TABLE student2121
        (course VARCHAR(20), courseID VARCHAR(20),
        MarkObtained REAL, MarkExpected INTEGER);
        """
# create a connection to the SQLite database 
con = sqlite3.connect(':memory:')

# execute SQL query
con.execute(query)

# Commit the current transaction
con.commit()

In [12]:
# create entries in table
data = [('Data Science Foundation', 'CSE421A', 48, 50),
        ('Computer Vision', 'CSE407A', 45, 50),
        ('Computational Intelligence', 'CSE422A', 38, 50)]

# query to insert into student2121 table
stmt = "INSERT INTO student2121 VALUES(?, ?, ?, ?)"

# to execute a SQL command repeatedly
con.executemany(stmt, data)

# Commit the current transaction
con.commit()

In [13]:
# get all the rows from table
cursor = con.execute('select * from student2121')

# fetch all rows
rows = cursor.fetchall()

# store the fetched data as a pandas dataframe
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

                       course courseID  MarkObtained  MarkExpected
0     Data Science Foundation  CSE421A          48.0            50
1             Computer Vision  CSE407A          45.0            50
2  Computational Intelligence  CSE422A          38.0            50

#### using pandas

In [14]:
# create a connection to the SQLite database 
conn = sqlite3.connect(':memory:')

# column names and records of the table
columns = ["course", "courseID","MarkObtained", "MarkExpected"]
data = [('Data Science Foundation', 'CSE407A ', 49, 50),
        ('Computer Vision', '20CSE422A ', 45, 50),
        ('Computational Intelligence', 'CSE422A ', 38, 50)]

# create a dataframe 
df = pd.DataFrame(data,columns=columns)

# use pandas function to create/write to database
# it creates a new database if it doesnt already exist
# if it exists, we can choose to replace, append or fail
df.to_sql("newstudent2121",conn,if_exists="replace")

In [15]:
# read from sqlite using pandas function
pd.read_sql('select * from newstudent2121', conn)

   index                      course    courseID  MarkObtained  MarkExpected
0      0     Data Science Foundation    CSE407A             49            50
1      1             Computer Vision  20CSE422A             45            50
2      2  Computational Intelligence    CSE422A             38            50